In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [3]:
df

                   A         B         C         D
2013-01-01  0.452665 -1.116167  1.201363 -1.329515
2013-01-02 -0.436369  0.129930  2.322741  0.118099
2013-01-03 -1.332035 -0.151088  0.484098 -1.852582
2013-01-04 -1.695115  0.139451 -0.675104 -1.956823
2013-01-05  1.433760 -1.704074  0.163334 -0.446366
2013-01-06 -0.728082  1.073607 -0.281357 -1.377082

In [4]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [5]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [6]:
df1

                   A         B         C         D    E
2013-01-01  0.452665 -1.116167  1.201363 -1.329515  1.0
2013-01-02 -0.436369  0.129930  2.322741  0.118099  1.0
2013-01-03 -1.332035 -0.151088  0.484098 -1.852582  NaN
2013-01-04 -1.695115  0.139451 -0.675104 -1.956823  NaN

In [7]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01  0.452665 -1.116167  1.201363 -1.329515  1.0
2013-01-02 -0.436369  0.129930  2.322741  0.118099  1.0

In [8]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01  0.452665 -1.116167  1.201363 -1.329515  1.0
2013-01-02 -0.436369  0.129930  2.322741  0.118099  1.0
2013-01-03 -1.332035 -0.151088  0.484098 -1.852582  5.0
2013-01-04 -1.695115  0.139451 -0.675104 -1.956823  5.0

In [9]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True